[
  {
    "url": "https://economictimes.indiatimes.com/news/international/global-trends/trump-organisation-launches-trump-mobile-phone-network/articleshow/121885522.cms",
    "source": "Economic Times",
    "content": "The Trump Organization launched a self-branded mobile service and a $499 smartphone on Monday, dubbed Trump Mobile, signaling a new effort to court conservative consumers with a wireless service positioned as an alternative to major telecom providers.The new mobile venture will include call centers based in the United States and phones made in America, the organization said.\"We are going to be introducing an entire package of products where people can come and they can get telemedicine on their phones for one flat monthly fee, roadside assistance on their cars, unlimited texting to 100 countries around the world,\" said the president's eldest son, Donald Trump Jr., announcing the product at Trump Tower in New York.The Trump family, long known for its real estate empire, luxury hotels, and golf resorts, has in recent years ventured into newer arenas including digital media and cryptocurrency.The Trump Organization, which is the main holding entity for most of the U.S. president's business ventures, said ahead of Trump's inauguration that control of the company would be handed to his children, replicating the arrangement from his first term, though concerns about potential conflicts of interest remain.Live EventsA website that went live after the announcement included details of the new Trump-branded smartphone that will be available from September, and a $47.45 a month subscription plan to the new network.DTTM Operations — the entity managing President Trump's trademarks — has filed applications to use his name and the term \"T1\" for telecom-related services.The filings, submitted Thursday to the U.S. Patent and Trademark Office, cover mobile phones, accessories  cases and chargers, wireless telephone services, and possibly even retail stores.The smartphone industry in the United States is among the most saturated and competitive in the world, with leading global players Apple and Samsung dominating the market.More than 60 million smartphones are purchased annually by American consumers, but nearly all of these devices are manufactured abroad — primarily in China, South Korea, and increasingly in India and Vietnam.Despite the strength of U.S.-based tech brands, there is no significant domestic smartphone production infrastructure, largely due to high labor costs, supply chain complexity, and reliance on overseas component sourcing.The U.S. mobile network market is dominated by three national carriers: Verizon, AT&T, and T-Mobile, which together control over 95% of the wireless market. These companies operate massive, capital-intensive infrastructures and offer bundled services to tens of millions of rs. (You can now  to our Economic Times WhatsApp channel)"
  },
  {
    "url": "https://economictimes.indiatimes.com/news/international/global-trends/trump-mobile-as-presidents-family-announces-cell-phone-company-a-journalists-bizarre-experience-surfaces/articleshow/121887304.cms",
    "source": "Economic Times",
    "content": "Benchmarks Nifty25,149.85-205.41FEATURED FUNDS★★★★★UTI Aggressive Hybrid Fund Regular Plan-Growth5Y Return21.28 % Invest NowFEATURED FUNDS★★★★★HSBC Large Cap Fund Direct-Growth5Y Return19.69 % Invest NowEnter search text:"
  },
  {
    "url": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-mobile-unbelievable-nothing-ceo-carl-pei-says-were-cooked-ahead-of-phone-3-launch/articleshow/121912398.cms",
    "source": "Economic Times",
    "content": "US President Donald Trump has entered the mobile phone market with a new product called the T1 Phone. The Trump Organisation Monday announced a mobile phone service and a Trump-branded smartphone, extending the family real estate company into the vast US telecom market.The all-new T1 Mobile uses the \"Trump\" name under a trademark license. The handset carries a price tag of $499 and runs on Android 15 operating system. The launch of Trump Mobile drew a lot attention and various reactions on social media and one of them to react to it was London-based smartphone company Nothing CEO Carl Pei.Nothing CEO on Trump MobileCarl Pei has d a post on X (formerly Twitter) writing: “Phone (3) has some competition now”, adding “We’re cooked”. Known for his speaking his mind, Carl Pei d a surprisingly glowing review online. .“This phone — it’s unbelievable. Fast, beautiful, does everything. People are switching — they’re tired of the junk. It’s a total winner. Everyone loves it,” he said.ALSO READ: VA spokesperson issues clarification on bombshell report claiming doctors can refuse treatment to DemocratsHe even added, “We’re cooked. Phone 3a has some competition now.” Whether he was being serious or sarcastic is up for debate, but the comments definitely stirred up a buzz — especially with the Nothing Phone (3) expected soon.Live EventsAll about Trump mobileAnnouncing the new mobile network and smartphone, Donald Trump Jr. – the eldest son of US President Donald Trump said: “We are going to be introducing an entire package of products where people can come and they can get telemedicine on their phones for one flat monthly fee, roadside assistance on their cars, unlimited texting to 100 countries around the world,\" said the president's eldest son”.The announcement arrives exactly 10 years after the launch of President Donald Trump's first presidential campaign. The Trump Organization says that the entire device, which costs $499 is assembled in the US, but there is no information on when it will hit stores. However, the company has begun taking pre-orders with $100 down payment on its official website.ALSO READ: VA policy change: US doctors can question veterans whether they attended Trump's rallies before treatment?'Made in America' Trump Mobile 1 featuresDesign: The Trump Mobile 1 sports a gold-accented back panel and a triple-camera setup reminiscent of the iPhone’s design. The rear also features “T1” branding alongside an engraved U.S. flag.Display: It is equipped with a 6.78-inch AMOLED screen featuring a punch-hole design and a smooth 120Hz refresh rate.Performance: The device includes 12GB of RAM and 256GB of internal storage, which is expandable via a microSD card.Security: Unlock options include a fingerprint sensor and facial recognition.Processor: The specific chipset powering the Trump Mobile 1 has not yet been disclosed.ALSO READ: Jeff Bezos-Lauren Sanchez's lavish and star-studded $10-million wedding faces big hurdle in VeniceOperating System: The smartphone runs on Android 15.Cameras: On the rear, it features a triple-lens setup comprising a 50MP main camera, a 2MP depth sensor, and a 2MP macro lens, accompanied by an LED flash. The front houses a 16MP camera for selfies and video calls.Battery: A 5,000mAh battery powers the phone, supporting 20W fast charging.Connectivity: It offers a USB Type-C port, Bluetooth, Wi-Fi, and a 3.5mm headphone jack.ALSO READ: Virginia Primary 2025 is a crucial test for Democrats : Know the poll timings, documents neededCost: It costs $47.45 per month and the tariff plan is a symbolic reference to Trump's election to the White House twice. Trump was elected as the 45th (in 2012) and 47th (in 2020) US President. It offers unlimited calling and texting benefits. It also supports international calling covering 200 nations across North America, South America, Africa, Europe and Asia. Depending on the country, the international calling is capped at varying lengths ranging from unlimited (in India, Columbia, Chile, Cambodia and more), 60 minutes, 55-50 minutes, 40-30 minutes, 15 minutes and five minutes. Though it comes with unlimited internet data access, only the first 20GB of data can be used at high internet speed.(You can now  to our Economic Times WhatsApp channel)"
  },
  {
    "url": "https://economictimes.indiatimes.com/news/how-to/buying-refurbished-or-old-phone-6-crucial-factors-to-consider-before-making-your-purchase/articleshow/99531972.cms",
    "source": "Economic Times",
    "content": "In today's world, smartphones have become an integral part of our daily lives. They not only help us stay connected with our friends and family but also assist us in carrying out our work and accessing information. However, buying a brand new smartphone can be an expensive affair, and not everyone can afford it. This is where refurbished or old phones come in. Refurbished phones are pre-owned devices that have been restored to their original condition and sold at a lower price than their brand new counterparts. Old phones, on the other hand, are devices that have been used for a long time and sold at a lower price due to their wear and tear. However, before you buy a refurbished or old phone, there are a few things you need to keep in mind to ensure that you make a wise purchase.Know the Seller: The first and foremost thing to remember while buying a refurbished phone is to know the seller. You should only buy from a trusted and reputable seller who has a good track record of selling refurbished phones. It is recommended to buy from a seller who has been in the business for a long time and has a good reputation in the market. Do your research, read reviews, and check the seller's ratings before making a purchase.Check the Warranty: When buying a refurbished phone, it is essential to check the warranty. Make sure that the phone comes with a warranty that covers any defects or malfunctions. A warranty is an assurance that the phone has been restored to its original condition and that you will not face any issues with it. If the phone does not come with a warranty, it is best to avoid buying it.Check the Condition: If you are buying the phone online, make sure that the seller provides detailed pictures of the phone from all angles. Inspect the phone thoroughly for any visible damages, scratches, or dents. Also, check the buttons, camera, and ports to ensure that they are working correctly. If you are buying an old phone, you may have to accept some wear and tear. However, it is important to ensure that the phone is still in good condition and functions properly.Live EventsCheck the Battery Life: Battery life is an important factor to consider when buying a refurbished phone. Check the battery life of the phone and make sure that it is not degraded. If the battery life is less than 80%, it is best to avoid buying the phone. You can also ask the seller if the battery has been replaced or if it is the original battery that came with the phone.Look for Accessories: When buying a refurbished phone, it is important to check if it comes with the original accessories, such as the charger, earphones, and user manual. If the phone does not come with the original accessories, it may not be a good purchase.Consider the Price: Finally, consider the price of the refurbished phone. The price of a refurbished phone should be significantly lower than that of a brand new phone. If the price of the refurbished phone is too close to the price of a brand new phone, it may not be a good deal.Buying a refurbished or old phone can be a great way to save money, but it is important to remember the above-mentioned points before making a purchase. By ing these tips, you can ensure that you make a wise purchase and get a phone that meets your needs and expectations.(You can now  to our Economic Times WhatsApp channel)"
  }
]