[
  {
    "url": "https://indianexpress.com/article/technology/tech-news-technology/donald-trump-mobile-t1-phone-made-in-america-label-10087247/",
    "source": "Indian Express",
    "content": "By: Tech Desk New Delhi | June 25, 2025 14:10 IST 2 min read PRINT Trump Mobile's T1 Phone starts from $499. (Image  Trump Mobile)Last week, United States President Donald Trump launched a new smartphone called the T1 Phone. The Trump Organization describes the new phone as “a sleek, gold smartphone, engineered for performance and proudly designed and built in the United States.” Now, a recent report by the Financial Times suggests that it will be hard for the Trump T1 phone to bear the “Made in America” tag. In a statement to the publication, a Trump Mobile spokesperson said that the $499 T1 Phone is manufactured in “Alabama, California and Florida”. However, they did not offer any details about the production partners or how they plan to source components made in the US. Moreover, there are no details about the manufacturing facilities where the T1 phone will be made. According to Todd Weaver, CEO of Purism, it is hard to make a smartphone with the specifications Trump Mobile has promised. “Unless the Trump family secretly built out a secure, onshore or nearshore fabrication operation over years of work without anyone noticing, it’s simply not possible to deliver what they’re promising”, he added. Story continues below this ad Also Read | Gold in colour, costs $499: Five things to know about Trump’s new ‘Made in America’ phone Purism’s Librem 5 is the only phone in the world that carries the Made in America label. But since the company focuses on US manufacturing, its products are unable to compete with big smartphone manufacturers  Samsung or Apple when it comes to software or hardware specifications. If we take a look at the specifications of the T1 Phone, it resembles smartphones from existing Chinese manufacturers  Vivo and Umidigi, which means the T1 Phone may be a rebranded version of a budget Chinese phone from a fairly less popular brand. Also, according to the Federal Trade Commission’s guidelines, to get a “Made in the USA” label, the T1 Phone will require almost all or virtually all of its components to be made in the country. © IE Online Media Services Pvt Ltd Tags: Doanld Trump Latest Comment Post Comment Read Comments Expand"
  },
  {
    "url": "https://indianexpress.com/section/technology/gadgets/mobile-phone/motorola/moto-x4/",
    "source": "Indian Express",
    "content": "Moto X4 has a dual rear camera of 12 MP + 8 MP, while the front camera is 16 MP. The 12 MP camera comes with dual autofocus Pixel sensor and ƒ/2.0 aperture. The 8MP sensor has an ultra-wide angle with 120-degree field of view and f/2.2 aperture. Other features include LED, phase detection auofocus (PDAF), selective focus, slow-motion video, ultra-wide angle shot, selective black and white, spot colour, and more. It is capable of shooting 4K videos at 30fps, 1080P videos at 60fps, 720P videos at 30fps, and 480P videos at 30fps. The front camera, which is 16 MP, has a f/2.0 aperture and selfie flash. The storage options available are of 3 GB RAM and 32 GB ROM. The Moto X4 will provide expandable memory of up to 2TB on microSD Card support. There’s a 3000mAh non-removable battery that supports 15W TurboPower. It is claimed to offer 6 hours of power in 15 minutes of charging. Moto X4 comes with IP68 rating, which makes the device water resistant. The Moto X4 provides various sensors  fingerprint reader, gravity, proximity, accelerometer, ambient light, magnetometer, gyroscope, and sensor hub."
  },
  {
    "url": "https://indianexpress.com/article/technology/mobile-tabs/amazon-prime-day-sale-2025-5-best-smartphone-deals-10121918/",
    "source": "Indian Express",
    "content": "Written by Anurag Chawake New Delhi | Updated: July 13, 2025 08:49 IST 7 min read PRINT From budget to flagship, several smartphones are available at a discounted price during Amazon Prime Day sale. (Express Photo)Amazon has commenced its yearly Prime Day sale, bringing huge discounts on numerous consumer electronics  smartphones, tablets, laptops and audio accessories. The sale went live on July 12 and will end at 11:59 PM on July 14. As is the case every year, the consumers can grab numerous budget, mid-range and flagship smartphones at a heavily discounted price. If you are looking to purchase a new smartphone during the Amazon Prime Day sale 2025, here are some of the best deals on smartphones available right now. At Rs 74,999, the Galaxy S24 Ultra is the best Samsung phone you can get right now. (Express Photo) Samsung Galaxy S24 Ultra Launched last year, the Galaxy S24 Ultra (review) is Samsung’s first flagship phone to get seven years of OS updates and security patches. Story continues below this ad Powered by the Snapdragon 8 Gen 3, the flagship device sports a huge 120Hz 6.8-inch LTPO AMOLED screen with DX anti-reflective coating that is protected by Corning’s Gorilla Armor. As one would expect from a Samsung flagship, you get IP68 dust and water resistance, a titanium frame and a built-in S-Pen with Bluetooth functionality. Also Read | Rs 55,000 discount on Samsung Galaxy S24 Ultra: Here’s why its a steal deal  its predecessor, the Galaxy S24 Ultra has a boxy design and a 5,000mAh battery that supports 45W wired and 15W wireless charging. The back of the phone houses a quad camera setup that consists of a 200MP primary shooter, a 12MP ultrawide lens, a 10MP telephoto sensor with 3x optical zoom and a 50MP periscope telephoto lens with 5x optical zoom. The device runs on One UI 6 based on Android 14 out of the box, with Samsung promising OS updates till Android 21. If you are looking to buy a flagship phone that does not compromise on cameras, battery and don’t mind the slightly outdated flagship chipset, the Samsung Galaxy S24 Ultra is an easy recommendation for Rs 74,999. The OnePlus 13 is a great all rounder for the asking price. (Express Photo) OnePlus 13 OnePlus’ newest flagship device – the OnePlus 13 (review), is also available at a discounted price. Featuring the Snapdragon 8 Elite chipset, the newest from the company comes with a 120Hz 6.82-inch LTPO AMOLED screen that sports Ceramic Guard protection.  most 2025 flagships, you get both IP68 and IP69 protection alongside a huge 6,000mAh battery with 100W wired and 50W wireless charging support.Story continues below this ad The back of the phone has a huge circular camera island that houses a Hasselblad-tuned 50MP primary camera in addition to a 50MP ultrawide sensor and a 50MP telephoto lens with 3x optical zoom. The phone runs on OxygenOS 15 based on Android 15 and will get 4 years of OS updates and 5 years of security patches. The OnePlus 13 isn’t the best camera phone, but if you are looking for a snappy device with intuitive software, flagship-grade performance and a huge battery, this is a good buy. You can buy it during the sale for as low as Rs 64,999, but credit card users might be able to get it for less with bank offers. The iPhone 16e has a single 48MP camera. (Express Photo) Apple iPhone 16e Apple’s latest and most affordable smartphone – the iPhone 16e (review), is also getting a huge price cut. Launched earlier this year, the phone comes with a 6.1-inch Super Retina XDR OLED screen with 800 nits of brightness and Ceramic Shield glass protection. Running on iOS 18.3.1 out of the box, the iPhone 16e is powered by the in-house developed Apple A18 chipset and comes with up to 512GB of internal storage. It also happens to be the first smartphone to feature Apple’s indigenously developed 5G modem.Story continues below this ad  the iPhone SE series, the iPhone 16e packs a single camera with a resolution of 48MP. This isn’t the best iPhone, but it is indeed the cheapest phone in the iPhone 16 series. If you want to buy an iPhone without spending much, the iPhone 16e can be a good buy for Rs 49,999. The Realme GT 7 Pro is the only phone under Rs 50,000 to feature the Snapdragon 8 Elite. (Image  Realme) Realme GT 7 Pro Want a gaming phone under Rs 50,000 with a flagship chipset? The Realme GT 7 Pro might be a good purchase. Powered by the Snapdragon 8 Elite chipset, the phone has a 120Hz 6.78-inch LTPO AMOLED screen and is both IP68 and IP69 rated. The phone comes with Realme UI 6.0 based on Android 15 and will get 3 years of OS updates. On the back, you get a triple camera setup with a 50MP primary camera, a 50MP telephoto lens with 3x optical zoom and an 8MP ultrawide shooter. All of this is backed by a 5,800mAh battery that supports 120W wired charging. If you want a gaming phone with a huge battery and the best chipset in the market, the Realme GT 7 Pro is a steal deal for Rs 44,999.Story continues below this ad Note: It is currently the only phone with Snapdragon 8 Elite priced under Rs 50,000. Galaxy M36 is powered by the Exynos 1380. (Imaeg  Samsung) Samsung Galaxy M36 Looking for a mid-range Samsung device that will last you for years? Check out the recently launched Galaxy M36. The latest from Samsung packs in a 6.7-inch sAMOLED screen with a 120Hz refresh rate and comes with Gorilla Glass Victus+ protection. Running on One UI 7 based on Android 15, Samsung is promising up to 6 major OS updates, which makes it the only phone under Rs 20,000 with more than half a decade of software support. On the back, you get a minimal-looking elliptical camera island that consists of a 50MP primary lens, an 8MP ultrawide shooter and a 2MP macro sensor. The device is powered by Exynos 1580 and is backed by up to 8GB of RAM and 128GB of internal storage.Story continues below this ad However, un most mid-range devices launched this year, the Galaxy M36 has a side-mounted fingerprint scanner, which might be a bummer for some. Another downside is that the phone still has a 5,000mAh lithium-ion battery with 25W wired charging support. The base variant of the Galaxy M36 that comes with 6GB RAM and 128GB storage is currently selling for Rs 17,499, but if you can spend a bit more, we recommend going with the 8GB RAM version that costs Rs 18,999. Note: The price of these smartphones may change anytime during the sale, so make sure you check them before purchasing. Anurag Chawake Anurag Chawake is a Senior Sub-Editor at indianexpress.com. His fascination with technology and computers goes back to the days of Windows 98. Since then, he has been tinkering with various operating systems, mobile phones, and other things. Anurag usually writes on a wide range of topics including Android, gaming, and PC hardware among other things related to consumer tech. His Twitter, Instagram, Facebook and LinkedIn user name is antechx. ...  © IE Online Media Services Pvt Ltd Tags: Amazon Prime Day Apple iPhone OnePlus Realme Samsung Latest Comment Post Comment Read Comments Expand"
  },
  {
    "url": "https://indianexpress.com/article/technology/tech-reviews/nothing-phone-3-review-10123445/",
    "source": "Indian Express",
    "content": "Written by Anuj Bhatia New Delhi | Updated: July 17, 2025 09:31 IST 12 min read PRINT The Phone (3) makes use of AI with some brand-new features, such as Essential Search, a universal smart search bar which allows you to search across contacts, photos and files. (Image credit: Anuj Bhatia/Indian Express) In tech, one of the fundamental ways to become dominant is to make consumers submit to your vision and choose to live within that world. That’s why companies  Apple and Nintendo remain so successful, despite releasing several not-so-well-received products over the years. It’s not just one product that makes you popular, it’s how people believe in the brand and become fans of it. I see a similar pattern with Carl Pei–led Nothing, which is seeking the kind of validation that made Apple and Nintendo household names – not by ing a tried-and-tested formula, but by offering a distinctive take on everyday tech products. Its Phone (3), perhaps its first true high-end flagship, may tick all the boxes of what a premium smartphone should be, but at its core, it’s a doorway to something more playful. It’s an unusual experience, and sometimes it may or may not make sense, especially with the new Glyph Matrix interface. But that’s exactly what Nothing wants to be: a company known for doing the unexpected and embracing the strange. Story continues below this ad In fact, if I am honest, it feels refreshing and welcoming. And it’s okay if the Nothing Phone (3) isn’t the most spec-heavy smartphone – it has Nothing’s own quirkiness through and through. But this time, the ambitions are grand and so is the sticker price. The real question is: does the Phone (3), as baffling and fascinating as it might be, make sense to you? What: Nothing Phone (3)| Price: Rs 80,000 Polarising design Pick any Nothing device, and there’s a distinct dystopian aesthetic to it. I am glad the company is comfortable with its design choices and isn’t afraid to express itself. The Phone (3) s the same path though this time everything feels more polished. The see-through transparent glass back gives the device that signature Nothing feel. The back features a grid pattern, showcasing three printed circuit boards, along with visible screws, circles, and cutouts that give off the vibe of a tech product, not just another smartphone. I really d how the Phone (3) looks. (Image credit: Anuj Bhatia/Indian Express) The cameras, meanwhile, have a rather unusual layout. The three sensors are positioned within specific squares in a separated arrangement: two are lined up next to each other, while the third sits in a corner of the phone, not really aligned with anything else. It feels absolutely wild every time I see the Phone (3). Also Read | Nothing Headphone (1) review: Vintage flair and clear sound for a premium price There’s something undeniably charming about the Phone (3), with its retro-chic aesthetic. The hipster-friendly, old-school design may be polarising to some, but I kind of enjoy the goofiness and the disturbingly weird vibe at the same time. And honestly, that’s okay, as long as you are the right audience for it.Story continues below this ad The camera’s layout has shifted from the camera bump to a triple-rear camera, which sees two sensors sat below a third, all out of alignment. (Image credit: Anuj Bhatia/Indian Express) The Phone (3) looks beautiful and feels great in the hand. I love holding it in a way I haven’t since the iPhone X. It comes in black and white, and the white version, which I have for review, reminds me of the original iPod. The device features an aluminum and glass sandwich design and weighs 218 grams. The Phone (3) also supports the standard IP68 water and dust resistance. The Glyph Matrix interface For me, the most eye-catching feature of the Phone (3) is a small dot-matrix screen on the top-right corner of the device that powers the Glyph Matrix interface; and it’s a nifty experience. At times, it feels a bit gimmicky, but there’s a certain thrill to it. And because it’s a physical hardware feature (reminding me of the crank on the Playdate console), the interaction feels natural. Glyph Matrix offers an interactive option for users looking to get quick updates without using the main display. (Image credit: Anuj Bhatia/Indian Express) With the Phone (3), Nothing has done away with the signature “Glyph” LED strips on the back, the ones that used to light up in complex patterns for notifications, calls, timers, and charging, a staple of its earlier smartphones. In their place is the new Glyph Matrix interface. The idea remains the same: to notify users about things  messages and calls. But this time, since it’s a real display, it’s more functional. However, un many others who have tried (and failed) to integrate secondary displays, Nothing opted for a dot-matrix screen, the kind you often see on buses and at airports displaying important information. The matrix is made up of 489 LEDs and can display monochromatic images. Also Read | Why Nothing’s CMF Phone 2 Pro has the potential to make smartphones fun again Well, the Glyph Matrix showcases Glyph “Toys,” as Nothing calls them. Right now, there are a handful of Glyph Toys. Some are simple widgets,  a battery level indicator or a stopwatch. But my favourites are still the games,  Spin the Bottle, Rock, Paper, Scissors, and the Magic 8 Ball. One Glyph Toy that felt silly but fun to me is the one that lets you take photos and turn them into Glyph patterns. It reminded me of how Nintendo made a camera for the Game Boy that let you take photos and convert them into monochrome images. I am hoping to see more Glyph Toys in the future, as Nothing is making it easy to make your own Glyph Toys via an SDK.Story continues below this ad Glyph Matrix is a disc made up of 489 LEDs found at the rear of the device. (Image credit: Anuj Bhatia/Indian Express) I think the idea of a dot-matrix display is really fun, even if it may feel a bit silly at times. But that’s exactly what makes the Phone (3) stand out from other smartphones. I also d how you interact with the matrix through the Glyph button, which is built into the rear of the Phone (3). It’s a single button that, when pressed, activates the Glyph Matrix, allowing you to cycle through different Toys, with a long press used to activate them. The interaction is simple and intuitive, though I do wish there was some form of tactile feedback. In the Settings menu, you can customise the Glyph Matrix to your liking. A standout feature of the dot-matrix display is how neatly it handles notifications. You can choose to be notified about specific alerts from select apps and even set custom display artwork to appear on the Glyph Matrix, making it easier to recognise what the notification is about at a glance. I also  this notification approach because I don’t have to open the phone every time a notification comes in. It’s a better way to avoid the madness and anxiety that constant notifications can cause, especially when you don’t want to be glued to your phone. Fine-tuned hardware and software The Phone (3) has a 6.7-inch screen size; it’s a large, fast OLED display that supports a 120Hz refresh rate and reaches up to 1600 nits at maximum brightness, peaking at 4,500 nits with compatible HDR content, which looks really good. The Phone (3) is powered by a Snapdragon 8s Gen 4 processor, which is fast but not quite flagship-grade. Nothing is very clear that it’s not chasing the spec game with the Phone (3), and I think that makes sense, the longevity of the chip matters most, especially since smartphones these days receive software updates for years. In my time testing the Phone (3), the device felt snappy, and apps opened quickly with no noticeable lag. My review unit is a premium unit with 16GB RAM and 512GB of storage.Story continues below this ad Nothing Phone (3) ships with Android 15, with the custom Nothing OS 3.5 interface on top. (Image credit: Anuj Bhatia/Indian Express) The battery life is great: the Phone (3) ships with a 5,150 mAh battery that lasts about two days between charges, even with a mix of 5G and Wi-Fi usage. A compatible 65W wired charger is supported. There’s also 15W wireless charging, if you care about it. The Phone (3) runs Nothing’s version of Android 15, which offers a relatively clean, fast, and unique experience, thanks to subtle design touches based around dot-matrix art. The design language Nothing has used for the user interface is interesting, and the wide range of customisation options makes the interaction a lot more fun. I particularly enjoyed the monochrome, distraction-free themes. As for updates, Nothing’s software policy still doesn’t match the s of Google Pixel devices or Samsung Galaxy smartphones, but it’s getting close, with the company promising five Android OS upgrades and 7 years of security updates. Nothing Phone (3) feels great in hand. (Image credit: Anuj Bhatia/Indian Express) A major software addition to the Phone (3) is Nothing’s Essential Space app, which leans heavily on AI. The app essentially collects and analyses various screenshots, text, and voice notes. A dedicated button on the side of the phone captures what’s on screen, while pressing and holding it records a quick voice note to go along with it. The app then analyses the content to generate summaries, transcriptions, and possible actions such as reminders or to-do lists. Right now, the app is fairly basic, to say the least. Some features,  AI summaries, are hit-or-miss, but others,  Essential Search, show great potential. Improved cameras The Phone (3) has three cameras on the back: a 50MP main camera with an f/1.68 aperture, a 50MP ultra-wide camera with a 114-degree field of view, and a 50MP periscope lens offering up to 3x optical zoom, 6x digital zoom, and 60x AI Super Res Zoom. This will also serve as a macro camera, allowing for clearer close-up shots. The front-facing camera is also 50MP.Story continues below this ad Nothing Phone 3 camera samples. Image resized for web Nothing Phone 3 camera samples. Image resized for web Nothing Phone 3 camera samples. Image resized for web Nothing Phone 3 camera samples. Image resized for web Nothing Phone 3 camera samples. Image resized for web Nothing Phone 3 camera samples. Image resized for web Photos taken with the Phone (3)’s main camera look good, delivering fine detail and solid dynamic range. I think it performs well in most situations, though low-light performance isn’t its strong suit. The ultrawide camera is reasonably good, while the 3x zoom camera is arguably the best of the three. I wouldn’t say the Phone (3) beats the top smartphone cameras on the market, but it’s remarkably good, especially the 3x zoom, which lets you get incredibly close to subjects while capturing plenty of detail. It’s a great option if you enjoy taking macro-style shots. Should you buy the Nothing Phone (3)? The Phone (3) has more power than I know what to do with. That’s the premise Nothing is going for with its first and most expensive smartphone. It’s right there, but not quite in the same league as the highest-end options from Apple, Samsung, or Google. In fact, it’s the opposite, and that’s refreshing. It’s a smartphone that goes back to the basics, while still offering a sense of premiumness. Also Read | Nothing Phone 3A and 3A Pro review: Brimming with nostalgia but mighty in every sense The Phone (3) is a forward-looking device, and I admire it for its design and the unique dot-matrix display. At the same time, it’s a fascinating puzzle… one that takes some time to figure out. On the surface, Nothing’s new high-end smartphone feels deeply nostalgic, rooted in the idea of building a legacy in the way Apple and Nintendo have done. There’s a far more interesting device hidden in here, an experience that, at its best, has a sense of humour, if you can understand and relate to it. Anuj Bhatia Anuj Bhatia is a personal technology writer at indianexpress.com who has been covering smartphones, personal computers, gaming, apps, and lifestyle tech actively since 2011. He specialises in writing longer-form feature articles and explainers on trending tech topics. His unique interests encompass delving into vintage tech, retro gaming and composing in-depth narratives on the intersection of history, technology, and popular culture. He covers major international tech conferences and product launches from the world's biggest and most valuable tech brands including Apple, Google and others. At the same time, he also extensively covers indie, home-grown tech startups. Prior to joining The Indian Express in late 2016, he served as a senior tech writer at My Mobile magazine and previously held roles as a reviewer and tech writer at Gizbot. Anuj holds a postgraduate degree from Banaras Hindu University. You can find Anuj on Linkedin. Email: anuj.bhatia@indianexpress.com ...  © IE Online Media Services Pvt Ltd Tags: Android Smartphone Nothing smartphones Latest Comment Post Comment Read Comments Expand"
  },
  {
    "url": "https://indianexpress.com/article/technology/tech-reviews/vivo-x-fold-5-review-10134044/",
    "source": "Indian Express",
    "content": "Written by Nandagopal Rajan New Delhi | Updated: July 18, 2025 10:43 IST 8 min read PRINT Vivo X Fold 5 Review: The Vivo X Fold 5 is as thin as normal smartphone in its folded state. (Image Credit: Nandagopal Rajan/Indian Express)Hypothesis: Foldable phones are ideal for use as business phones Test device: Vivo X Fold 5 with 16GB RAM + 512GB storage I have been fortunate enough to witness the journey of foldables from the beginning, that too from close quarters. A few years down the line, I am now impressed by how well this form factor has evolved to become more practical, with no learning involved, and plugging gaps that the regular smartphone can’t. The vivo X Fold 5, which I believe will be the first of many foldables to make a mark by being as thin as regular smartphones, is a good example of this evolution. Story continues below this ad The vivo X Fold 5 is the Snapdragon 8 Gen 3 chipset. (Image Credit: Nandagopal Rajan/Indian Express) The vivo X Fold 5 is a phone that will surprise you from the moment you take it out of the box. There are multiple reasons for this. It is a very thin phone in its folded avatar. In fact, as thin as the iPhone 16 Pro Max when you ignore the camera bump. This slim build is despite a large 6000 mAh battery inside The camera is at par with other vivo flagships, offering 100x digital zoom and Zeiss optics The crease in the middle is now even more subdued and almost invisible in most cases. I would, however, call these all part of a natural evolution, and am certain companies  vivo, OnePlus, and Samsung would have moved the needle even more on these fronts by this time next year. The 6.5-inch cover screen isn’t as narrow as it used to be and makes you feel  you are using a normal smartphone. (Image Credit: Nandagopal Rajan/Indian Express) So what really matters is how usable the foldable phone is now. And this is where the thin build makes a huge difference. I have noticed that a lot of people who use a foldable phone prefer to carry a regular smartphone along, maybe because of the better camera or battery life. Now, the X Fold 5 changes this dynamic in two ways. You don’t need that second phone because both the battery life and the camera quality on the Vivo X Fold 5 are flagship quality. If you want that second phone, it becomes much easier to manage it when the fold is this thin. With the Vivo X Fold 5, I also realised something interesting: for most of the time, I was using it  a regular phone. And this is because the 6.5-inch cover screen was as good as any smartphone I have reviewed this year. Yes, it is still a bit narrow compared to a regular phone, but it is no longer the squeezed display we encountered in the first few generations of folds. In the 10-odd days I have been using this device, I never once felt this was a different form factor while using the phone folded.Story continues below this ad Vivo has optimised the X Fold 5 for multitasking. (Image Credit: Nandagopal Rajan/Indian Express) The business phone hypothesis To test my hypothesis, I set up the Vivo X Fold 5 with only my office mail ID, which is on Google Workspace. The idea was that I would not entertain any distractions on this phone. So instead of Instagram, Facebook, and Candy Crush, I loaded the phone with ChatGPT, Perplexity, and Manus, all of which have become important apps for my work profile. And this was a good decision, as every reel that is d with me by my wife takes me into at least a 30-minute rabbit hole of doom scrolling. It is a great idea to use a focus phone for work, and not just a focus mode on the phone. And this is when I started realising that I was able to handle a lot of work just on the phone,  checking spreadsheets, tagging new comments on the,m and even replying to older comments. With a squarish form factor of the open Vivo X Fold 5, you get space for Google Sheets, as well as real estate below for a lot of the work. Also, vivo has gone on to optimise the interface for a large screen with multi-tasking that is accessible in many ways. For instance, you can tap the dock at the bottom and open apps that are running in the background and get a split view. Or there is the side-loading dock from where apps open as an inset video over the app you already have open. Plus, there is the option to open the app menu directly from the screen to cycle between apps. All this makes working on multiple apps convenient and natural. I was working with up to three screens live at times, though that kind of multitasking usually does not yield positive results.Story continues below this ad Also, this form factor gives you a lot of business opportunities, so to speak. For instance, while on a Zoom call, you can have a window open for your points or for an app  Granola to take notes for you. Plus, while consuming content on YouTube or a podcast, you can have an AI tool in a small window transcribing and summarising for you. Un most foldables, the camera on the X Fold 5 is on par with other Vivo flagship devices. (Image Credit: Nandagopal Rajan/Indian Express) The other aspect is, of course, the camera, which we had not been expecting to be all that great in foldable phones, given their form factor challenges. I found the camera on the X Fold 5 almost as good as the X200, which I think is the best Android camera of the past few months. I could zoom up to 100x, though with some distortion and noise, at which point the AI kicked in to give a decent image. This camera comes with Zeiss settings that really up your photography, especially when it comes to landscapes and street photography. But the more important point here is that you will not need to carry a secondary phone just because it has a better camera. Camera Sample 1. (Image Credit: Nandagopal Rajan/Indian Express) Camera Sample 2. (Image Credit: Nandagopal Rajan/Indian Express) Camera Sample 3. (Image Credit: Nandagopal Rajan/Indian Express) Camera Sample 4. (Image Credit: Nandagopal Rajan/Indian Express) Camera Sample 5. (Image Credit: Nandagopal Rajan/Indian Express) Camera Sample 6. (Image Credit: Nandagopal Rajan/Indian Express) One of my biggest worries in life is that my phone will run out of battery, especially when I am travelling. With the Vivo X Fold 5, you can rest assured that the battery will hold up until the end of the day in all cases. And this is a big hurdle that vivo has crossed when it comes to the adoption of foldables. Plus, the phones charge back to half in less than 30 minutes with the 80W Dual-Cell FlashCharge. And wireless charging, that’s too fast at 40W, is always a convenience.Story continues below this ad The 6,000mAh battery is the largest ever on a foldable device. (Image Credit: Nandagopal Rajan/Indian Express) Verdict At Rs 1,49,999, the vivo X Fold 5 — the phone has a single Titanium Gray variant in India with 16GB RAM + 512GB storage — is one of the best foldable options available at the moment. The foldables are maturing as a segment, and the X Fold 5 shows that now it can be trusted as a business phone that is not cutting any corners to make the form factor viable. For work, this form factor is emerging as the new BlackBerry. Nandagopal Rajan Nandagopal Rajan writes on technology, gadgets and everything related. He has worked with the India Today Group and Hindustan Times. He is an alumnus of Calicut University and Indian Institute of Mass Communication, Dhenkanal. ...  © IE Online Media Services Pvt Ltd Tags: Android smartphone Vivo Latest Comment Post Comment Read Comments Expand"
  }
]