[
  {
    "url": "https://www.indiatoday.in/technology/news/story/google-phone-app-update-makes-calls-easier-more-fun-and-colourful-than-ever-2745930-2025-06-25",
    "source": "India Today",
    "content": "Google is giving its Phone app a fresh coat of paint. The new design change is part of the company's broader Material 3 Expressive design rollout, which focuses on a more vibrant, personalised, and emotive design language for user interfaces on Android and Wear OS devices. The changes specific to the Phone app are being rolled out gradually to Public Beta users this week. The refresh introduces a number of functional and aesthetic changes, offering an intuitive, visually appealing, and user-friendly calling experience.The new update for Google’s Phone app brings a redesigned interface that makes connecting with your most important contacts quicker, and your call history easier to navigate. One of the most notable changes is the introduction of a new \"Home\" tab, which replaces the previous \"Favourites,\" \"Recents,\" \"Contacts,\" and \"Voicemail\" tabs with a more streamlined three-tab layout: \"Home,\" \"Keypad,\" and \"Voicemail.\"At the top of the new \"Home\" tab, users will find a convenient \"Favourites bar,\" displaying their top contacts as circular icons for quick access without needing to navigate to a separate tab. Below this, Google has also simplified the call log. To improve clarity, calls from the same person will no longer be nested under a single entry. Instead, each call will appear as a distinct chronological entry, making it easier to track your call history at a glance. While this change might clutter the list slightly, it’s aimed at helping users track call patterns more clearly –  noticing how often someone has tried to reach them. Another highlight of this revamp is a new gesture-based way to answer or decline calls. The incoming call screen will now feature a horizontal swipe gesture. This design tweak comes in response to user feedback, with many finding the horizontal motion more intuitive and less prone to accidental taps – especially when pulling the phone out of a pocket or bag.Additionally, the incoming call screen is also getting a visual refresh. Contacts will now be framed in playful, uneven circles to add a touch of personality to every call.This Phone app update is part of Google's broader design evolution across its ecosystem. Google launched Android 16 earlier this month, and the new OS integration for Android phones is expected to fully embrace the Material 3 Expressive redesign in an upcoming release.Google is also gradually infusing this new design language into its suite of apps, aiming for a more cohesive and expressive user experience across its platforms. The company has already released the Android 16 update for Pixel phones, and a wider rollout is expected later this year – ly around September. Meanwhile, Pixel users have recently received a new “Pixel VIP” widget that further integrates with favourite contacts by displaying their location, call history, and even personal notes.- EndsPublished By: Divya BhatiPublished On: Jun 25, 2025Also Read | GitHub CEO says goal of future engineers is different, AI won't take their jobs if they can do thisAlso Read | After Pixel 9, Google Pixel 10 tipped to skip vapour chamber cooling once againAlso Read | Google Pixel 10 Pro Fold leak says it will have IP68 rating before Samsung Galaxy Z Fold 7 July 9 launch"
  }
]