[
  {
    "url": "https://www.livemint.com/technology/can-nvidia-persuade-governments-to-pay-for-sovereign-ai-11752590985477.html",
    "source": "LiveMint",
    "content": "Late in 2023 Jensen Huang, chief executive of Nvidia, began peddling a new idea. Every country, he said, should have its own artificial-intelligence (AI) system, trained on domestic data, aligned with national values and built using local infrastructure. Appealing to policymakers’ fondness for manufacturing, the boss of the chip colossus described these systems as “AI factories”, ingesting data and churning out intelligence. He called it “sovereign AI”."
  },
  {
    "url": "https://www.livemint.com/news/world/nvidia-ceo-jensen-huang-says-china-s-military-unlikely-to-use-us-ai-chips-11752460408769.html",
    "source": "LiveMint",
    "content": "Nvidia CEO Jensen Huang says China’s military unlikely to use US AI Chips: ‘They simply can’t rely’Nvidia Corp. Chief Executive Officer Jensen Huang said the US government doesn’t need to be concerned that the Chinese military will use his company’s products to improve their capabilities. LivemintUpdated14 Jul 2025, 09:59 AM ISTJensen Huang, CEO of Nvidia, speaks during the Viva Technology conference dedicated to innovation and startups at Porte de Versailles exhibition center in Paris, France, June 11, 2025. (REUTERS)Nvidia Corp. Chief Executive Officer Jensen Huang said the US government doesn’t need to be concerned that the Chinese military will use his company’s products to improve their capabilities.Addressing the largest concern Washington has cited in placing increasing restrictions on US technology exports to the Asian nation, Huang said the Chinese military will avoid using US technology because of the risks associated with doing so.Also Read | Nvidia CEO Jensen Huang to hold media briefing in Beijing on July 16“We don’t have to worry about it,” he said in an interview on CNN’s Fareed Zakaria GPS broadcast Sunday.“They simply can’t rely on it,” he added. “It could be, of course, limited at any time.”Since 2022, the US government has imposed restrictions on the export of Nvidia’s most advanced chips to China, citing concerns over potential military applications. The US also imposed a ban earlier this year on sales of Nvidia's H20 artificial intelligence chips to the country - which had been Nvidia's most powerful AI chip cleared for Chinese sales.Also Read | The week in charts: Brics disjointed, power demand down, Nvidia hits $4 trillionAlso Read | Nvidia CEO Jensen Huang to hold media briefing in Beijing on July 16Huang and his peers have lost out on billions of dollars of revenue under increasingly tough rules designed to shut off China from access to the most powerful artificial intelligence capabilities. Successive administrations in Washington have maintained that unfettered use of the most capable components would pose a risk to national security.Nvidia’s CEO, who was in Washington last week before a trip to Beijing, has argued that the strategy will fail because it will spur growth of domestic capabilities in China that will eventually rival those created by the US technology industry.Also Read | How Nvidia became the world’s first $4 trillion companyNvidia and its peers say US companies should be allowed to ship to the world’s largest market for semiconductors to keep their products central to the development of AI.Huang met with President Donald Trump last week to make his case again and has praised the administration’s push to increase domestic production of semiconductors.Nvidia and others are dependent on the manufacturing facilities of Taiwan Semiconductor Manufacturing Co., the majority of which are located on its home island, just off the Chinese mainland.Also Read | Jensen Huang adds $27.6 billion net worth in 2025 as Nvidia makes historyTrump touted the success of Nvidia and its growth to become the first US company to reach a $4 trillion market capitalization. Details of a White House meeting between the two weren’t made public but so far the administration and politicians on both sides have remained firm on not allowing more access for Chinese companies.(With inputs from agencies) Stay updated with the latest Trending, India , World and United States news. Business NewsNewsWorldNvidia CEO Jensen Huang says China’s military unlikely to use US AI Chips: ‘They simply can’t rely’MoreLess"
  },
  {
    "url": "https://www.livemint.com/technology/gadgets/10-best-laptops-for-working-professionals-to-handle-multitasking-with-ease-top-picks-that-are-light-fast-and-efficient-11750329782800.html",
    "source": "LiveMint",
    "content": "Work isn’t slowing down, and your laptop shouldn’t either. You need something that boots up fast, runs smoother than your morning coffee and doesn’t crash when you open 10 apps at once. That’s where this list of the 10 best laptops for working professionals comes in handy. You might be juggling video calls, handling spreadsheets, or firing off urgent proposals, these laptops are built to match your pace."
  },
  {
    "url": "https://www.livemint.com/technology/gadgets/best-slim-laptops-for-portability-and-performance-top-10-picks-from-top-brands-11751008463607.html",
    "source": "LiveMint",
    "content": "Amit RahiI have immersed myself in the tech world for over five years, focusing my efforts on providing readers with in-depth reviews of gadgets. Exploring the ins and outs of the latest tech has been quite a journey. As a storyteller, my goal is to make tech both understandable and exciting for people like me who love gadgets....Read more"
  },
  {
    "url": "https://www.livemint.com/technology/gadgets/best-laptops-under-40-000-june-2025-with-latest-processors-ssd-storage-and-windows-11-features-top-10-picks-11750755338438.html",
    "source": "LiveMint",
    "content": "Nivedita MishraWith over 28 years of writing and editing experience across various domains, I now specialise in gadgets, electronics, and appliances. I provide readers with valuable insights to help them make informed purchase decisions....Read more"
  },
  {
    "url": "https://www.livemint.com/technology/gadgets/massive-laptop-price-drops-on-amazon-prime-day-sale-2025-up-to-40-off-on-apple-hp-lenovo-and-more-11752226503352.html",
    "source": "LiveMint",
    "content": "Aishwarya FaraswalI am a seasoned content and copywriter with over four years of experience in a bunch of domains such as entertainment, fashion, beauty, education and home appliances. I use my experience in covering these assorted list of industries in helping readers find the latest products for their daily use....Read more"
  }
]