[
  {
    "url": "https://www.prnewswire.com/news-releases/lg-brings-the-power-of-ai-to-ultra-light-laptops-with-new-lg-gram-pro-models-302506509.html",
    "source": "PR Newswire",
    "content": "Content not found"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/us-pricing--availability-of-2025-lg-gram-laptops-announced-302382737.html",
    "source": "PR Newswire",
    "content": "U.S. PRICING & AVAILABILITY OF 2025 LG GRAM LAPTOPS ANNOUNCED News provided by LG Electronics USA Feb 24, 2025, 08:00 ET Share this article Share toX Share this article Share toX Select Models Now Available for Pre-Order on LG.com Eligible to Receive Exclusive Offers Including Free +view Portable MonitorENGLEWOOD CLIFFS, N.J., Feb. 24, 2025 /PRNewswire/ -- LG Electronics USA (LG) today announced pricing and pre-order availability of its 2025 AI-enabled LG gram lineup, the company's first on-device AI-laptops powered by Intel®1 Core™ Ultra Series 2 CPUs. Introduced at CES 2025, the new lineup includes the LG gram Pro Z90TP ($1999 to $2399), LG gram Pro Copilot+PC Z90TS ($1849 to $2399), LG gram Pro 2-in-1 T90TP ($1999 to $2399) and LG gram Copilot+PC Z90TL ($1999 to $2399). Leveraging LG's gram AI technology, and cloud AI capabilities powered by GPT-4o, these laptops deliver impressive hybrid AI performance while preserving the LG gram's iconic slim and lightweight design.2 Continue Reading Leveraging LG’s gram AI technology, and cloud AI capabilities powered by GPT-4o, these laptops deliver impressive hybrid AI performance while preserving the LG gram’s iconic slim and lightweight design. The 2025 LG gram laptops set a new benchmark in the series’ history, powered by Intel’s next-generation Core Ultra Series 2 processors: The Intel Core Ultra H- Series 2 (Arrow Lake) and the Intel Core Ultra V-Series 2 (Lunar Lake). LG Electronics USA (LG) today announced pricing and pre-order availability of its 2025 AI-enabled LG gram lineup, the company’s first on-device AI-laptops powered by Intel®1 Core™ Ultra Series 2 CPUs. The 2025 LG gram laptops present a smarter, more secure and highly-personalized user experience through LG’s innovative gram AI that includes gram Chat."
  }
]