[
  {
    "url": "https://www.prnewswire.com/news-releases/lg-brings-the-power-of-ai-to-ultra-light-laptops-with-new-lg-gram-pro-models-302506509.html",
    "source": "PR Newswire",
    "content": "Content not found"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/us-pricing--availability-of-2025-lg-gram-laptops-announced-302382737.html",
    "source": "PR Newswire",
    "content": "U.S. PRICING & AVAILABILITY OF 2025 LG GRAM LAPTOPS ANNOUNCED News provided by LG Electronics USA Feb 24, 2025, 08:00 ET Share this article Share toX Share this article Share toX Select Models Now Available for Pre-Order on LG.com Eligible to Receive Exclusive Offers Including Free +view Portable MonitorENGLEWOOD CLIFFS, N.J., Feb. 24, 2025 /PRNewswire/ -- LG Electronics USA (LG) today announced pricing and pre-order availability of its 2025 AI-enabled LG gram lineup, the company's first on-device AI-laptops powered by Intel®1 Core™ Ultra Series 2 CPUs. Introduced at CES 2025, the new lineup includes the LG gram Pro Z90TP ($1999 to $2399), LG gram Pro Copilot+PC Z90TS ($1849 to $2399), LG gram Pro 2-in-1 T90TP ($1999 to $2399) and LG gram Copilot+PC Z90TL ($1999 to $2399). Leveraging LG's gram AI technology, and cloud AI capabilities powered by GPT-4o, these laptops deliver impressive hybrid AI performance while preserving the LG gram's iconic slim and lightweight design.2 Continue Reading Leveraging LG’s gram AI technology, and cloud AI capabilities powered by GPT-4o, these laptops deliver impressive hybrid AI performance while preserving the LG gram’s iconic slim and lightweight design. The 2025 LG gram laptops set a new benchmark in the series’ history, powered by Intel’s next-generation Core Ultra Series 2 processors: The Intel Core Ultra H- Series 2 (Arrow Lake) and the Intel Core Ultra V-Series 2 (Lunar Lake). LG Electronics USA (LG) today announced pricing and pre-order availability of its 2025 AI-enabled LG gram lineup, the company’s first on-device AI-laptops powered by Intel®1 Core™ Ultra Series 2 CPUs. The 2025 LG gram laptops present a smarter, more secure and highly-personalized user experience through LG’s innovative gram AI that includes gram Chat."
  },
  {
    "url": "https://www.prnewswire.com/news-releases/phone-case-market-to-grow-by-usd-13-9-billion-2024-2028-driven-by-rising-smartphone-penetration-report-on-how-ai-is-driving-market-transformation---technavio-302358951.html",
    "source": "PR Newswire",
    "content": "Phone Case Market to Grow by USD 13.9 Billion (2024-2028), Driven by Rising Smartphone Penetration, Report on How AI is Driving Market Transformation - Technavio News provided by Technavio Jan 24, 2025, 01:08 ET  this article  toX  this article  toX NEW YORK, Jan. 24, 2025 /PRNewswire/ -- Report with the AI impact on market trends - The global phone case market size is estimated to grow by USD 13.9 billion from 2024-2028, according to Technavio. The market is estimated to grow at a CAGR of over 6.76% during the forecast period. Growth in penetration of smart mobile phones is driving market growth, with a trend towards growing penetration of e-commerce vendors in tier II and tier III cities. However, lack of universal standards poses a challenge. Key market players include Ai Paiqi Electronic Technology Co., Ltd., Apple Inc., Case Mate Inc., CG Mobile, Cygnett, Element Case Inc., Fommy.com, Hon Hai Precision Industry Co. Ltd., Moshi Corp., Otter Products LLC, Pelican Products Inc., Poetic Cases Inc., Rearth Inc., Reiko Wireless Inc., Samsung Electronics Co. Ltd., Spigen Inc., Urban Armor Gear LLC, Vinci Brands LLC, and XtremeGuard.  Technavio has announced its latest market research report titled Global Phone Case market 2024-2028 Key insights into market evolution with AI-powered analysis. Explore trends, segmentation, and growth drivers- View Free Sample PDF Phone Case Market Scope Report Coverage Details Base year 2023 Historic period 2018 - 2022 Forecast period 2024-2028 Growth momentum & CAGR Accelerate at a CAGR of 6.76% Market growth 2024-2028 USD 13.9 billion Market structure Fragmented YoY growth 2022-2023 (%) 6.13 Regional analysis APAC, North America, Europe, South America, and Middle East and Africa Performing market contribution APAC at 70% Key countries US, China, India, and Japan Key companies profiled Ai Paiqi Electronic Technology Co., Ltd., Apple Inc., Case Mate Inc., CG Mobile, Cygnett, Element Case Inc., Fommy.com, Hon Hai Precision Industry Co. Ltd., Moshi Corp., Otter Products LLC, Pelican Products Inc., Poetic Cases Inc., Rearth Inc., Reiko Wireless Inc., Samsung Electronics Co. Ltd., Spigen Inc., Urban Armor Gear LLC, Vinci Brands LLC, and XtremeGuard Market DriverThe smartphone market is booming with over 500 million users in India alone. To protect these valuable devices, the demand for protective cases is on the rise. With repair costs for damaged phones steep, investing in quality protective cases is a wise choice. Lifestyle and social media trends favor customization, making accessory brands  OtterBox, PopSockets, and Body Glove popular. E-commerce platforms dominate the market, offering same-day delivery and high-speed internet. New designs with innovative functions  MagSafe compatibility, ultrathin, minimalist, and rugged cases are in demand. Sustainable materials such as recycled phone cases made of eco-friendly and biodegradable materials are gaining traction. Dedicated online retailers cater to mobile users, offering a wide range of protective covers, from plastic cases with thermoplastic polyurethane to silica gel, leather, and shockproof cases with air-cushioned corners. Electronics stores, mobile accessory shops, and department stores also sell protective cases offline. The online store segment of the digital marketplace continues to grow, with ecommerce platforms  Amazon, Flipkart, and dedicated mobile accessory websites leading the way. The e-commerce sector in developing economies, including India, has witnessed remarkable growth, particularly in Tier 2 and Tier 3 cities. Major e-commerce players are expanding their reach, providing shopping experiences to semi-urban and rural consumers. Previously, urban residents enjoyed the privilege of purchasing branded items, advanced gadgets, and high-quality foodstuffs. However, with the proliferation of online stores, consumers in these areas are adopting digital shopping trends. The global e-commerce market has experienced due to the COVID-19 pandemic, and India's market is projected to reach a valuation of USUSD 300 billion by 2030, according to the India Brand Equity Foundation (IBEF). Request Sample of our comprehensive report now to stay ahead in the AI-driven market evolution!Market Challenges The smartphone market is booming with over 500 million users in India alone. Protective cases have become essential accessories for these mobile users, as repair costs for damaged devices can be high. Quality protective cases are in demand, with trends leaning towards customization and innovative functions. E-commerce platforms and online portals are popular choices for consumers, offering same-day delivery and high-speed internet. Brands  OtterBox, PopSockets, and Body Glove lead the market with their protective cases made of materials such as polycarbonate, thermoplastic polyurethane, silica gel, and leather. New designs and sustainable materials  recycled phone cases are also gaining popularity. Consumers can find these cases in both offline retail stores and online marketplaces, including electronics stores, mobile accessory shops, and department stores. Customized, rugged, shockproof, waterproof, and minimalist cases are available in various colors and styles, catering to different lifestyle trends and social media preferences. MagSafe compatibility, ultrathin, and biodegradable cases are also emerging as key trends in the market. The phone case market faces challenges due to the absence of standardization in the technology and components used in their production. This issue results in significant product and price differentiation, making it difficult for consumers to compare and select accessories. Vendors must collaborate to establish uniform standards to ensure improved quality, consumer confidence, and compatibility. Failure to do so could hinder the expansion of the phone case market. Discover how AI is revolutionizing market trends- Get your access now!Segment Overview This phone case market report extensively covers market segmentation by Distribution Channel 1.1 Offline 1.2 Online Product 2.1 Body glove 2.2 Pouch 2.3 Phone skin 2.4 Hybrid cases 2.5 Others Geography 3.1 APAC 3.2 North America 3.3 Europe 3.4 South America 3.5 Middle East and Africa 1.1 Offline- The offline segment holds the largest market  in the global phone case market in 2023, with numerous offline retailers offering competitive prices and the preference of consumers for physical product verification. In India, China, and Brazil, the increasing number of organized retail stores, including those of OnePlus and Croma, will expand the availability of phone cases. OnePlus aims to open authorized brand stores in eight major cities in India and launched its largest store in Hyderabad. Croma, a subsidiary of Tata Sons Pvt. Ltd., plans to add 100 new stores in 2022. This organized retail growth, combined with unorganized stores specializing in phone cases, will boost the segment's growth during the forecast period.Download a Sample of our comprehensive report today to discover how AI-driven innovations are reshaping competitive dynamicsResearch AnalysisThe global phone case market is witnessing significant growth due to the increasing use of smartphones and the need to protect these devices from damages. Protective cases have become essential accessories for mobile users, with trends leaning towards customization and sustainability. Lifestyle and social media trends influence the demand for phone cases, with e-commerce platforms and physical stores catering to this need. The online store segment, including digital marketplaces, is witnessing in sales due to the convenience and accessibility they offer. Quality protective cases made from sustainable and ecofriendly materials, such as recycled phone cases and biodegradable phone cases, are gaining popularity among consumers. MagSafe compatibility, ultrathin cases, and rugged phone cases are other popular categories. Customized cases, including Body Glove and Fre Series, allow users to express their individuality. Repair costs for damaged phones can be reduced by investing in a good quality protective case from the start. Overall, the phone case market is expected to continue its growth trajectory in the coming years.Market Research OverviewThe phone case market is thriving as the use of smartphones continues to increase. Protective cases have become essential accessories for mobile users to safeguard their devices from damages. Repair costs for broken screens and other damages can be steep, making quality protective cases a worthwhile investment. Lifestyle and social media trends favor customization and personalization, leading to an array of designs and innovative functions. E-commerce platforms and online portals dominate the market, offering same-day delivery, high-speed internet, and dedicated retailers. New designs, sustainable materials, and MagSafe compatibility are popular trends. Brands  Body Glove, OtterBox, PopSockets, and others offer a range of protective cases in various materials such as polycarbonate, thermoplastic polyurethane, silica gel, leather, and more. Offline retail stores also cater to mobile users, providing a tactile experience for customers. The market segment includes e-commerce platforms, physical stores, and online stores. Accessories  PopSockets, spring-inspired colors, air-cushioned corners, and rugged, shockproof, waterproof, and dustproof cases are also available. Recycled phone cases made from eco-friendly and sustainable materials are gaining popularity as consumers become more conscious of their environmental impact.Table of Contents:1 Executive Summary2 Market Landscape3 Market Sizing4 Historic Market Size5 Five Forces Analysis6 Market Segmentation Distribution Channel Offline Online Product Body Glove Pouch Phone Skin Hybrid Cases Others Geography APAC North America Europe South America Middle East And Africa 7 Customer Landscape8 Geographic Landscape9 Drivers, Challenges, and Trends10 Company Landscape11 Company Analysis12 AppendixAbout TechnavioTechnavio is a leading global technology research and advisory company. Their research and analysis focuses on emerging market trends and provides actionable insights to help businesses identify market opportunities and develop effective strategies to optimize their market positions.With over 500 specialized analysts, Technavio's report library consists of more than 17,000 reports and counting, covering 800 technologies, spanning across 50 countries. Their client base consists of enterprises of all sizes, including more than 100 Fortune 500 companies. This growing client base relies on Technavio's comprehensive coverage, extensive research, and actionable market insights to identify opportunities in existing and potential markets and assess their competitive positions within changing market scenarios.ContactsTechnavio ResearchJesse MaidaMedia & Marketing ExecutiveUS: +1 844 364 1100UK: +44 203 893 3200Email: [email protected]Website: www.technavio.com/SOURCE Technavio WANT YOUR COMPANY'S NEWS FEATURED ON PRNEWSWIRE.COM? 440k+ Newsrooms & Influencers 9k+ Digital Media Outlets 270k+ Journalists Opted In GET STARTED × Modal title"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/the-top-season-to-break-or-lose-your-phone-is-here-as-consumers-brace-for-price-hikes-302472398.html",
    "source": "PR Newswire",
    "content": "The Top Season to Break or Lose Your Phone is Here, as Consumers Brace for Price Hikes News provided by Asurion Jun 03, 2025, 15:16 ET  this article  toX  this article  toX The \"summer surge\" in tech accidents has higher stakes in 2025 – Asurion® s tips to prepare NASHVILLE, Tenn., June 3, 2025 /PRNewswire/ -- School is out, temps are on the rise, beach towns are filling up – it's beginning to look a lot  summer. This year, however, the season arrives amidst a hum of uncertainty as Americans brace for much-speculated price hikes on consumer goods, from groceries to clothing to electronics. Regarding the latter, consumers are warned to be extra cautious this summer – chances of breaking or losing your phone shoot way up from June to September. (Your other tech devices face increased risk, too.) Price tags aren't the only thing expected to rise this summer.For years, tech care company Asurion® has tracked the \"summer surge\" in tech accidents. Last year, the company saw insurance claims for lost and damaged phones increase more than 20% during the summer months compared to the rest of the year. Liquid damage incidents nearly doubled as record-breaking temperatures sent Americans (and their phones) flocking to pools, lakes, and oceans for refuge. The splash zone wasn't the only risk factor; claims for \"unrecoverable\" phones – those dropped over the side of a boat, for example – surged 66%. Let's not forget cracked screens and back-glass, which rose 18% and 43% respectively as people spent more time out and about. July 4th continues to rank as the most dangerous day for your phone, with 52% more incidents than an average day. As for non-mobile devices – laptops, tablets, game consoles, and the  – Asurion saw a 13% lift in claims during the summer months. The most at risk? Gaming devices. Claims rose by nearly a quarter, often tied to increased use during summer break, plus transport-related accidents when traveling with consoles and handhelds. Consumers have options, even if tech prices climb.No one wants to be faced with unplanned repair or replacement expenses, especially in the current climate. Here's the good news: whether you fall victim to gravity, circumstance, or plain bad luck, you have options beyond shelling out for a costly device replacement. If you have an Asurion-backed protection plan, your next steps are easy. Simply file a claim and once approved, Asurion will facilitate a repair or replacement, often as soon as same-day. The most you would have to pay is your deductible – though you might not owe anything at all, depending on your plan and the nature of the incident. Protection plans offer budget predictability and comfort in knowing that if something happens to your device, you're covered – no matter what else is going on in the market. If you don't have a protection plan, don't stress. Most issues can be fixed at a fraction of the cost of buying a new device. uBreakiFix® by Asurion stores fix millions of gadgets every year, from screens, back-glass, and cameras to water damage, charging issues, data recovery, and more. Whether your phone crashed face-down on the concrete or your laptop got splashed while working poolside, the repair experts at uBreakiFix by Asurion can help. You can stop by one of nearly 700 stores nationwide, or they can even come to you in some cases. If your device is damaged beyond repair, you can still save on a replacement. Consider buying a refurbished or last-gen model – just make sure to do your due diligence to ensure you're getting a good quality device at a fair price. Most uBreakiFix by Asurion stores offer quality-tested refurbished phones that work with any carrier and come with a 90-day warranty. Tech longevity is the best bang for your buck.Tech accidents aside, the best way to stretch your dollar is to hold onto your devices as long as possible before replacing. Getting the most from your gadgets may require some simple and inexpensive maintenance – things  replacing your phone battery when it starts to degrade; tuning up your laptop after years of downloads and delayed software updates; or cleaning your game console of dust and debris – all of which can add years to the life of your devices. Another part of maintenance: getting timely repairs when something does break, lest it develop into a bigger (and more expensive) issue. And for the love of tech, skip the rice next time a device gets doused. There are better ways to dry out wet tech – and the experts at Asurion and uBreakiFix by Asurion are always happy to help. For more information about protection plans, repair services, and more: asurion.com and ubreakifix.com. About AsurionOur journey in tech care began with cellphone insurance, back when consumers' biggest tech worry was a lost or broken phone. Decades later, we're still dedicated to caring, but now we look after all the essential devices that power your life—tablets, computers, TVs, game consoles, smart speakers, fitness trackers, video doorbells, and nearly everything in between. With thousands of experts nationwide and hundreds of local repair shops, all supported by the most advanced supply chain in the industry, we've proudly cared for millions of customers with thousands of different devices. From setup, troubleshooting, repairs, or replacements, we get your favorite tech back up and running, often as soon as the same day. Asurion is ready to help however you need it — online, over the phone, in your neighborhood, or even at your doorstep. SOURCE Asurion WANT YOUR COMPANY'S NEWS FEATURED ON PRNEWSWIRE.COM? 440k+ Newsrooms & Influencers 9k+ Digital Media Outlets 270k+ Journalists Opted In GET STARTED × Modal title"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/landmark-phones-in-focus-initiative-aims-to-collect-evidence-and-inform-effective-school-cell-phone-policies-302423364.html",
    "source": "PR Newswire",
    "content": "Landmark \"Phones In Focus\" Initiative Aims to Collect Evidence and Inform Effective School Cell Phone Policies News provided by Phones In Focus Apr 08, 2025, 09:00 ET  this article  toX  this article  toX Public school educators invited to participate in 5-minute survey that will ultimately shape set of evidence-based recommendations for managing student cell phone use PHILADELPHIA, April 8, 2025 /PRNewswire/ -- A nonpartisan group of academic researchers today launched a national survey that seeks to gather information from public school teachers, principals, and other school staff about cell phone policies and their impact on student achievement and well-being. The 5-minute survey is part of a broader initiative called \"Phones in Focus,\" which aims to ultimately provide educators with evidence-based recommendations for managing student cell phone use ahead of the 2025-2026 school year. \"Phones in Focus\" is led by Angela Duckworth, best-selling author and professor of psychology at the University of Pennsylvania, in collaboration with Stanford University economists Matt Gentzkow and Hunt Allcott. \"A recent poll shows most school leaders believe cell phones undermine academic performance, mental health, and student attention. And while many schools have put into place policies to restrict cell phone use, they've done so without adequate evidence of what actually works,\" Duckworth said. \"Phones in Focus aims to change this by collecting insights from those closest to students and leveraging that data to create a roadmap for the future.\" Phones in Focus launches as education leaders and policymakers are increasingly focused on cell phone usage in schools. In their 2025 state of the state addresses, at least 17 governors discussed the impact of cell phones, and state legislatures are increasingly mandating restrictions. Despite this increased attention, the existing research on cell phone policies is surprisingly limited, with most studies relying on small sample sizes and cross-sectional data. As a result, current policies vary widely across the country, from complete bans to classroom-level management approaches. The survey, which is now available at phonesinfocus.org, will collect data on these various policy approaches, including: Bell-to-bell bans with phones stored in the main office Partial bans permitting use during lunch and between classes Classroom-level management with teacher-determined rules \"Away for the day\" requirements Technology pouches that lock phones during school hours Public school educators, including principals, teachers and other school personnel, who complete the survey will be entered to win cash prizes and donations to their school. By matching survey responses to longitudinal data on academic outcomes, attendance, and school climate, researchers will identify which policies correlate with better results. Phones In Focus will produce preliminary analyses in July to help inform evidence-based policies as schools prepare for the 2025-2026 school year. \"What we lose when we're on our devices so much is…human connection,\" d American Federation of Teachers President Randi Weingarten, who has made phone-free classrooms a top policy priority, at a recent conference. wise, in an interview with Education Week, National Education Association President Becky Pringle emphasized, \"Student mental health is a serious and growing concern for parents and educators, exacerbated by social media and personal-device use in schools.\" \"School cell phone policies aren't merely an administrative issue—they're about creating learning environments where students can thrive both academically and socially,\" Duckworth said. \"It's time to let data, not just debate, guide this critical conversation. We encourage all public school educators to take just 5 minutes to complete our survey at phonesinfocus.org.\" About Phones In FocusPhones In Focus is a nonpartisan research initiative led by Angela Duckworth (University of Pennsylvania) in collaboration with economists Hunt Allcott and Matt Gentzkow (Stanford University). The project is funded through philanthropic support and aims to provide evidence-based recommendations for school phone policies that optimally support academic learning, healthy social relationships, and emotional well-being. Visit phonesinfocus.org to take the quick 5-minute survey and contribute to this important research. Media Contact:Angela Duckworth[email protected] SOURCE Phones In Focus WANT YOUR COMPANY'S NEWS FEATURED ON PRNEWSWIRE.COM? 440k+ Newsrooms & Influencers 9k+ Digital Media Outlets 270k+ Journalists Opted In GET STARTED × Modal title"
  },
  {
    "url": "https://www.prnewswire.com/in/news-releases/huawei-brings-worlds-first-commercial-triple-foldable-phone-to-mwc-2025-302390000.html",
    "source": "PR Newswire",
    "content": "Huawei Brings World's First Commercial Triple Foldable Phone to MWC 2025 India - English USA - Pусский Korea - 한국어 USA - Polski USA - English APAC - Traditional Chinese USA - español Middle East - Arabic USA - Italiano Japan - Japanese USA - Français MEXICO - Spanish USA - Deutsch Indonesia - Bahasa USA - slovenčina USA - čeština USA - Turkish BRAZIL - Portuguese USA - Nederlands News provided by HUAWEI 03 Mar, 2025, 18:05 IST  this article  toX  this article  toX BARCELONA, Spain, March 3, 2025 /PRNewswire/ -- This year's Mobile World Congress (MWC 2025) kicked off on March 3 in Barcelona, Spain. At the event, Huawei is showcasing its unique tri-fold phone, HUAWEI Mate XT | ULTIMATE DESIGN, as well as various other high-end, fashion-forward, and technology-driven flagship products. Attendees can visit dedicated experience zones for foldables, health & fitness, photography, and tools for creative work, and see how Huawei is applying the latest technologies to daily life.  Huawei Brings World's First Commercial Triple Foldable Phone to MWC 2025 Huawei Brings World's First Commercial Triple Foldable Phone to MWC 2025 Many have been particularly excited to see the Mate XT, the world's first commercial tri-fold smartphone. It features proprietary hinge and screen technologies that have allowed Huawei to build a phone where the screen folds inward on one hinge and outward on another. It's also equipped with a camera with a 10-size adjustable physical aperture. In the Huawei Consumer BG booth, a large screen utilizing naked-eye 3D effects further showcases the merits of this unique tri-fold phone. Also on display at the Consumer BG booth are the HUAWEI Mate 70 series phones, which boast an Ultra Chroma Camera that delivers unprecedented color accuracy. The Intelligence Scenario experience zone allows attendees to get their hands on features including Multi exposure and AI retouch. The Mate X6 area takes a novel approach by showcasing some of the innovative materials that go into the phone. Attendees are invited to cut ice with a sheet of graphene, to experience for themselves the amazing thermal conductivity of the material. To showcase its extensive range of wearables, Huawei is simulating real-life sports and health scenarios. In the cycling experience area, participants can experience the fast and accurate vital sign monitoring capabilities of HUAWEI TruSense System by comparing real-time heart rate data from professional sports heart rate monitors with that captured by a HUAWEI WATCH GT 5. In the Health Glance zone, visitors can see a demonstration of the multiple health indicators measured by HUAWEI WATCH D2, the first smart wearable to be medically certified as a wrist-based ambulatory blood pressure monitor. Huawei also brought a lineup of smart wearables that offer a premium on-wrist experience with exceptional design and smart features. In recent years, smart wearables have been a powerful engine of growth for Huawei's consumer business. Huawei's accumulated wearable shipments for the first three quarters of 2024 put it ahead of all competitors in the wearable space. Last September, Huawei announced HUAWEI TruSense System, which monitors health & fitness data and analyzes the user's health status. The system is a thorough revamp of the company's previous health metrics system, and was on full display in Barcelona. The GoPaint experience zone has been attracting crowds with an exhibition of works created by artists from around the world using the HUAWEI MatePad's exclusive GoPaint software, which is powered by a professional brush engine and FangTian Painting Engine 2.0. Huawei has its sights set on both professional and aspiring creatives with this year's MatePad Pro 13.2\" OLED PaperMatte Display. PaperMatte Display is a proprietary standard for tablet displays that deliver vibrant colors while minimizing glare, and gives users a pen-on-paper writing and drawing experience. HUAWEI M-Pencil (3rd generation) is intended for use with the MatePad Pro 13.2\". With its 10,000-level pressure sensitivity, the M-Pencil lets users make the most of GoPaint's many and varied virtual brushes. HUAWEI MatePad Pro 13.2-inch also features PC-level WPS Office and a familiar laptop interface, so that users can enjoy flexible window zooming and keyboard-and-mouse-based interactions, as well as efficient multi-tasking, thanks to the Live-Multitask feature.Photo - https://mma.prnewswire.com/media/2631720/bad2ba195a2a493b4afb2f9b2bcbb3b.jpg Photo - https://mma.prnewswire.com/media/2631723/ee135cbc03ea6313876f82088bee6d8.jpg × Modal title"
  },
  {
    "url": "https://www.prnewswire.com/in/news-releases/nothings-phone-3a-series-to-be-powered-by-snapdragon-302377854.html",
    "source": "PR Newswire",
    "content": "Search When typing in this field, a list of search results will appear and be automatically updated as you type. Searching for your content... No results found. Please use Advanced Search to search all press releases."
  },
  {
    "url": "https://www.prnewswire.com/in/news-releases/nothing-introduces-phone-2a-302079831.html",
    "source": "PR Newswire",
    "content": "Search When typing in this field, a list of search results will appear and be automatically updated as you type. Searching for your content... No results found. Please use Advanced Search to search all press releases."
  }
]