[
  {
    "url": "https://timesofindia.indiatimes.com/technology/tech-news/nvidia-ceo-jensen-huang-calls-chinese-ai-models-world-class-including-the-one-banned-by-the-us-government/articleshow/122573397.cms",
    "source": "Times of India",
    "content": "Nvidia CEO Jensen Huang described artificial intelligence models from Chinese firms as \"world class\" during a supply chain expo in Beijing, just one day after the US chipmaker announced it would resume sales of its popular H20 AI chips to China.\"Models like DeepSeek (the open-source model that was banned by the US), Alibaba, Tencent, MiniMax, and Baidu Ernie bot are world class, developed here and shared openly [and] have spurred AI developments worldwide,\" Huang said at the opening ceremony of the third China International Supply Chain Expo.The praise comes as Nvidia navigates complex US-China trade tensions while maintaining its position in the crucial Chinese market. The company expects to resume H20 chip shipments to China soon following assurances from the US government, after being forced to halt sales in April due to new export requirementsChina's open-source AI approach wins Huang’s praiseHuang specifically lauded Chinese companies for embracing open-source AI development, contrasting with proprietary approaches taken by some US firms. \"China's open-source AI is a catalyst for global progress, giving every country and industry a chance to join the AI revolution,\" he said.The CEO highlighted how more than 1.5 million developers in China currently build on Nvidia's technology, while noting that AI \"powers\" popular Chinese consumer apps including Tencent's WeChat, Alibaba's Taobao, ByteDance's Douyin, and Meituan's delivery services.Chip sales resume amid easing trade restrictions\"I have been assured that the licenses will come very fast. There are many order books already in,\" Huang told the media on the sidelines of the expo, referring to the resumption of H20 chip sales.US Commerce Secretary Howard Lutnick said Tuesday that the planned resumption was part of broader US-China negotiations on rare earths exports. The development follows recent trade talks in London, where both countries began easing some high-tech export restrictions.This is Jensen Huang's third visit to China this year, and that underscores the market's importance for Nvidia despite ongoing trade tensions between the world's two largest economies.AI Masterclass for Students. Upskill Young Ones Today!– Join Now"
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/tech-news/us-senators-send-warning-letter-to-nvidia-ceo-jensen-huang-we-are-worried-that/articleshow/122406004.cms",
    "source": "Times of India",
    "content": "A group of US senators has issued a stern warning to Nvidia CEO Jensen Huang regarding his upcoming trip to China, a report has said. In a letter sent on Friday, Republican Senator Jim Banks and Democratic Senator Elizabeth Warren urged Huang to refrain from meeting with Chinese companies suspected of undermining US chip export controls or those with ties to Beijing's military and intelligence bodies. They also specifically cautioned against engaging with entities on the US restricted export list, according to a report by news agency Reuters.“We are worried that your trip to the PRC could legitimise companies that cooperate closely with the Chinese military or involve discussing exploitable gaps in US export controls,\" the senators reportedly wrote, highlighting concerns about potential circumvention of critical US technology safeguards. The senators underscored a consensus on the controlled export of advanced AI hardware, stressing that such technology could “accelerate the PRC's effort to modernise its military.”PollDo you agree with the senators' warning to Huang about potential risks during his trip?No, it's overly cautious.Yes, it's a valid concern.Nvidia says win for US guaranteed when its technology sets ‘global standard’An Nvidia spokesperson responded to the concerns by stating that \"American wins\" when its technology sets \"the global standard.\" The spokesperson emphasised China's vast pool of software developers, asserting that AI software \"should run best on the US technology stack, encouraging nations worldwide to choose America.”This development comes after Jensen Huang publicly praised US President Donald Trump’s decision to ease some AI chip export controls in May at the Computex trade show in Taipei, calling prior restrictions a “failure.” Huang previously estimated that US restrictions on Nvidia's modified AI chips for China, imposed in April, would reduce the company's revenue by $15 billion.Last month, Reuters reported that a senior US official alleged AI firm DeepSeek was assisting China's military and intelligence operations and had attempted to use shell companies to circumvent US AI chip export controls. There have been reports of Chinese companies are flying to Malaysia to train AIm models, then take the results back to China.AI Masterclass for Students. Upskill Young Ones Today!– Join Now"
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/laptops-pc/11",
    "source": "Times of India",
    "content": "Content not found"
  }
]