[
  {
    "url": "https://timesofindia.indiatimes.com/technology/tech-news/nvidia-ceo-jensen-huang-calls-chinese-ai-models-world-class-including-the-one-banned-by-the-us-government/articleshow/122573397.cms",
    "source": "Times of India",
    "content": "Nvidia CEO Jensen Huang described artificial intelligence models from Chinese firms as \"world class\" during a supply chain expo in Beijing, just one day after the US chipmaker announced it would resume sales of its popular H20 AI chips to China.\"Models like DeepSeek (the open-source model that was banned by the US), Alibaba, Tencent, MiniMax, and Baidu Ernie bot are world class, developed here and shared openly [and] have spurred AI developments worldwide,\" Huang said at the opening ceremony of the third China International Supply Chain Expo.The praise comes as Nvidia navigates complex US-China trade tensions while maintaining its position in the crucial Chinese market. The company expects to resume H20 chip shipments to China soon following assurances from the US government, after being forced to halt sales in April due to new export requirementsChina's open-source AI approach wins Huang’s praiseHuang specifically lauded Chinese companies for embracing open-source AI development, contrasting with proprietary approaches taken by some US firms. \"China's open-source AI is a catalyst for global progress, giving every country and industry a chance to join the AI revolution,\" he said.The CEO highlighted how more than 1.5 million developers in China currently build on Nvidia's technology, while noting that AI \"powers\" popular Chinese consumer apps including Tencent's WeChat, Alibaba's Taobao, ByteDance's Douyin, and Meituan's delivery services.Chip sales resume amid easing trade restrictions\"I have been assured that the licenses will come very fast. There are many order books already in,\" Huang told the media on the sidelines of the expo, referring to the resumption of H20 chip sales.US Commerce Secretary Howard Lutnick said Tuesday that the planned resumption was part of broader US-China negotiations on rare earths exports. The development follows recent trade talks in London, where both countries began easing some high-tech export restrictions.This is Jensen Huang's third visit to China this year, and that underscores the market's importance for Nvidia despite ongoing trade tensions between the world's two largest economies.AI Masterclass for Students. Upskill Young Ones Today!– Join Now"
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/tech-news/us-senators-send-warning-letter-to-nvidia-ceo-jensen-huang-we-are-worried-that/articleshow/122406004.cms",
    "source": "Times of India",
    "content": "A group of US senators has issued a stern warning to Nvidia CEO Jensen Huang regarding his upcoming trip to China, a report has said. In a letter sent on Friday, Republican Senator Jim Banks and Democratic Senator Elizabeth Warren urged Huang to refrain from meeting with Chinese companies suspected of undermining US chip export controls or those with ties to Beijing's military and intelligence bodies. They also specifically cautioned against engaging with entities on the US restricted export list, according to a report by news agency Reuters.“We are worried that your trip to the PRC could legitimise companies that cooperate closely with the Chinese military or involve discussing exploitable gaps in US export controls,\" the senators reportedly wrote, highlighting concerns about potential circumvention of critical US technology safeguards. The senators underscored a consensus on the controlled export of advanced AI hardware, stressing that such technology could “accelerate the PRC's effort to modernise its military.”PollDo you agree with the senators' warning to Huang about potential risks during his trip?No, it's overly cautious.Yes, it's a valid concern.Nvidia says win for US guaranteed when its technology sets ‘global standard’An Nvidia spokesperson responded to the concerns by stating that \"American wins\" when its technology sets \"the global standard.\" The spokesperson emphasised China's vast pool of software developers, asserting that AI software \"should run best on the US technology stack, encouraging nations worldwide to choose America.”This development comes after Jensen Huang publicly praised US President Donald Trump’s decision to ease some AI chip export controls in May at the Computex trade show in Taipei, calling prior restrictions a “failure.” Huang previously estimated that US restrictions on Nvidia's modified AI chips for China, imposed in April, would reduce the company's revenue by $15 billion.Last month, Reuters reported that a senior US official alleged AI firm DeepSeek was assisting China's military and intelligence operations and had attempted to use shell companies to circumvent US AI chip export controls. There have been reports of Chinese companies are flying to Malaysia to train AIm models, then take the results back to China.AI Masterclass for Students. Upskill Young Ones Today!– Join Now"
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/laptops-pc/11",
    "source": "Times of India",
    "content": "Content not found"
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/tech-news/donald-trump-launches-smartphone-after-threatening-apple-samsung-with-tariffs-what-t1-phone-8002-phones-listing-tells-and-does-not/articleshow/121900965.cms",
    "source": "Times of India",
    "content": "President Donald Trump has unveiled his own smartphone brand, Trump Mobile, just weeks after threatening Apple and Samsung with steep tariffs unless they move production to the United States. The timing appears designed to capitalize on his \"America First\" manufacturing rhetoric while offering consumers a domestic alternative to foreign-made devices.Donald Trump's flagship device, the T1 Phone 8002 (Gold version), carries a $499 price tag and can be reserved with a $100 down payment for September delivery. The phone is marketed as \"designed and built in the USA,\" positioning it as the patriotic choice Trump has been demanding from major manufacturers.The launch comes after Trump's May threat to impose \"at least 25 percent\" tariffs on iPhones and similar devices manufactured overseas. He specifically targeted Apple CEO Tim Cook, stating that iPhones sold in America must be manufactured domestically, not in India or elsewhere. Trump extended the tariff threat to \"Samsung and anybody that makes that product,\" as he told White House reporters, with implementation potentially beginning at the end of June. The timing appears designed to capitalize on his broader commitment to reshoring technology manufacturing.Specifications of T1 Phone 8002: What the listing page tells and what it does not The T1 Phone 8002 boasts some impressive hardware for its price, including a 6.78-inch AMOLED display with 120Hz refresh rate, 256GB storage, 12GB RAM, and a 5,000mAh battery. The device features three rear cameras led by a 50MP main sensor, Android 15, and notably includes a 3.5mm headphone jack, a rarity among modern smartphones.However, the Trump Mobile website doesn't tell much about the smartphone, and displays what appears to be heavily manipulated product images. No processor is listed despite a dedicated section on the specifications page, a critical omission for any smartphone launch.Why Trump’s America-made T1 Mobile is a far-fetched realityIndustry observers note that the September delivery timeline seems optimistic given the typical 12-18 month development cycle for new smartphones. The Trump Mobile venture requires customers to place $100 deposits for pre-orders, with the remainder due upon delivery.Trump's assertion that the phone is manufactured domestically contradicts industry consensus about smartphone production capabilities in the United States. Even Apple CEO Tim Cook has repeatedly stated that domestic iPhone production faces significant infrastructure and supply chain challenges.Currently, virtually no smartphone manufacturers, including those based in the US, produce their devices on American soil. The complex supply chains and specialized manufacturing capabilities required for modern smartphones remain concentrated in Asia, particularly China, despite ongoing efforts by companies  Apple to diversify production to countries  India.AI Masterclass for Students. Upskill Young Ones Today!– Join Now"
  },
  {
    "url": "https://timesofindia.indiatimes.com/world/us/only-allows-you-to-text-in-caps-donald-trump-launches-mobile-phones-social-media-reacts/articleshow/121897021.cms",
    "source": "Times of India",
    "content": "EditionININUSEnglishEnglishहिन्दीमराठीಕನ್ನಡதமிழ்বাংলাമലയാളംతెలుగుગુજરાતીSign InTOIworldUSTimes EvokePakistanSouth AsiaUKEuropeChinaMiddle EastRest of WorldMad, Mad WorldPhotosVideosWeb StoriesToday's ePaperNewsResultsLife trailSocial PulsevideosPhotosExplainersIndians in USHumouroffbeat"
  },
  {
    "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/de-stress/how-you-hold-the-phone-can-reveal-how-intelligent-you-are/articleshow/116166190.cms",
    "source": "Times of India",
    "content": "Your phone could be more than just a tool-it might be a window into your personality and your intelligence. According to the experts, how you are holding your phone may show some deeper behavioral patterns or decision-making skills. This silly personality test might make you aware of some special things that are unique to you only. Let's find out and discover what our phone-holding style reveals about us.1. Holding your phone with one handIf you’re someone who holds your phone with one hand and navigates with your thumb, you’re ly confident and self-assured. You tend to take calculated risks and approach challenges with a thoughtful attitude, which often leads to success. Others admire your independence and ability to stay composed under pressure.In relationships, however, you may appear reserved. You carefully evaluate whether someone truly fits into your life before fully opening up. While this cautious approach may make you seem distant, it highlights your preference for deep, meaningful connections over fleeting interactions.2. Holding with one hand, navigating with the opposite thumbUsing one hand to hold your phone while scrolling with the opposite thumb suggests that you are analytical and intuitive. You are a natural problem solver, and you often depend on wisdom and logic to maneuver through life. Your sharp reasoning skills will make you hard to dupe, and you are mostly ahead in most situations.However, your approach to romance can be more impulsive. You might act hastily when it comes to matters of the heart, occasionally making decisions that don't align with your typically logical nature. Finding balance by slowing down could work wonders.3. Using both hands to hold your phoneYou can grip your phone with two hands, which means you are efficient and adaptable. You are good at dealing with fast-paced environments, and you face challenges head-on with focus and determination. You thrive on productivity, and people often look to you to get things done.However, when it comes to love, your practical side does not let you grow too much. You can often be afraid of displaying openness in your love. More emotional approach will lead to more connections in relationships.4. One hand holding, one finger navigatingA sign of creativity is holding your phone in one hand and navigating with the index finger of the other. You love thinking outside the box and usually work best alone, creating innovative ideas that impress others.In relationships, you can be shy at first. You take your time opening up to people, but once you open up, your vibrant and thoughtful personality shines. Your originality and depth make you an ideal partner for those who value authenticity.Whether you are confident, analytical, practical, or creative, your phone-holding style gives a glimpse into your personality. Which one best describes you?  it with friends and compare!"
  },
  {
    "url": "https://timesofindia.indiatimes.com/etimes/trending/trump-mobile-phone-is-here-price-features-and-everything-you-didnt-ask-for/articleshow/121901977.cms",
    "source": "Times of India",
    "content": "Memecoins are so passé; it’s time for Trump mobile phones!In a move that has left tech enthusiasts and political pundits buzzing, Donald Trump Jr. and Eric Trump unveiled the Trump Mobile service. What’s the occasion? Well, the Trump kids wanted to mark the 10th anniversary of Donald Trump's 2016 presidential campaign launch and do something special for their dad. Late Father’s Day celebration much? Seems so!Late appreciation, new gimmick!Donald Trump Jr. and Eric Trump didn’t just stop there. To make their dad proud and make America more tech-savvy, alongside the service – which is set to become available in September 2025 – the Trump kids introduced the T1 Phone—a gold-colored smartphone priced at $499, designed to cater to conservative consumers seeking a patriotic alternative in the tech market.What Is the T1 Phone?The T1 Phone is an Android-based device boasting a 6.8-inch AMOLED display, 256GB of storage, and a 50-megapixel camera. The device is marketed as being \"Made in America,\" with the Trump Organization emphasizing domestic manufacturing and customer support.However, industry experts have expressed skepticism about these claims, citing the challenges of establishing the necessary infrastructure for smartphone production in the United States of America.How much does it cost?Priced at $499, the T1 Phone positions itself in the mid-range market segment. The accompanying mobile service plan, dubbed \"The 47 Plan,\" offers unlimited talk, text, and data within the US, along with benefits such as 5G access, roadside assistance, and telehealth services. The plan is priced at $47.45 per month, which is seemingly a (not so) clever nod to Trump's status as both the 45th and 47th president of the United States.Made in America, really?While the Trump Organization promotes the T1 Phone as being \"Made in America,\" the feasibility of entirely domestic production remains uncertain. Critical smartphone components  processors, displays, and camera sensors are typically sourced globally, and final assembly traditionally occurs in Asia. No wonder the claim of a fully US-made device is met with skepticism by industry analysts!The obvious meme factorThe T1 Phone's gold-colored design and the \"Made in America\" branding are clearly aimed at appealing to patriotic consumers. However, the device's actual specifications and features place it in direct competition with established mid-range smartphones from companies  Samsung and OnePlus. The question remains: does the gold finish and political branding justify the price tag, or is it a golden gilded gimmick?Only time will tell!Trump’s Meme Coin Gala a FLOP? Guests Reveal Bad Food, No Booze & Chaos | WATCH"
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/tech-tips/what-is-it-phone-tapping-signs-that-your-phone-is-being-tapped-and-what-to-do-about-it/articleshow/108848834.cms",
    "source": "Times of India",
    "content": "EditionININUSSign InTOITechnologyTech TipsTech NewsMobiles & TabsGN Awards 2024GamingWearablesSocialAudioReviewsLaptops & PcAppliancesTimes TechiesGadgetsGadgetsMobile PhonesLaptopsSmart Watches HeadphonesTelevisionsCompare Mobile PhonesCompare LaptopsCompare Smart WatchesCompare HeadphonesCompare TelevisionsToday's ePaper"
  }
]